In [1]:
import pandas as pd
import numpy as np

In [17]:
data =  {'eng':[10,30,50,70],
         'kor':[20,40,60,80],
         'math':[90,50,20,70]}
df = pd.DataFrame(data,index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [3]:
df+1

   eng  kor  math
a   11   21    91
b   31   41    51
c   51   61    21
d   71   81    71

In [4]:
df*2

   eng  kor  math
a   20   40   180
b   60   80   100
c  100  120    40
d  140  160   140

In [5]:
df['eng']

a    10
b    30
c    50
d    70
Name: eng, dtype: int64

In [6]:
df['eng'] = [1,2,4,5]

In [7]:
df

   eng  kor  math
a    1   20    90
b    2   40    50
c    4   60    20
d    5   80    70

In [10]:
df.loc['a'] = df.loc['a']+2

In [14]:
df.loc['b':'c','kor':] = [[1,2],[3,4]]

# boolean indexing

In [16]:
# 행단위 불리언
df[[True,False,False,True]]

   eng  kor  math
a    3   22    92
d    5   80    70

# 관계 논리 연산자

In [20]:
df[df['eng']>30]

   eng  kor  math
c   50   60    20
d   70   80    70

In [22]:
df[(df['kor'] ==20) | (df['kor'] ==60)]

   eng  kor  math
a   10   20    90
c   50   60    20

In [23]:
df[(df['kor'] >=20) & (df['kor'] <=60)]

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [28]:

df[df['kor'].isin([20,40])]

   eng  kor  math
a   10   20    90
b   30   40    50

### query문을 이용하여 조건별 데이터 fetch

In [31]:
# df[df['eng']>30]
df.query('eng>30')

   eng  kor  math
c   50   60    20
d   70   80    70

In [32]:
# df[(df['kor'] ==20) | (df['kor'] ==60)]
df.query('kor==20 or kor==60')

   eng  kor  math
a   10   20    90
c   50   60    20

In [35]:
# df[(df['kor'] >=20) & (df['kor'] <=60)]
num=60
df.query(f'20<=kor<={num}')

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20